benchmark/report/rps/full/20260804_113000/raw/013_files_list_c1_r1.txt
Running 20s test @ http://127.0.0.1:32769/api/files?offset=0&limit=20
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.23ms    0.90ms  20.28ms   89.89%
    Req/Sec     0.87k   308.35     1.37k    63.50%
  Latency Distribution
     50%    0.91ms
     75%    1.36ms
     90%    2.14ms
     99%    4.70ms
  17334 requests in 20.02s, 8.71MB read
  Non-2xx or 3xx responses: 17334
Requests/sec:    865.83
Transfer/sec:    445.59KB
HPS_WRK_REQUESTS 17334
HPS_WRK_STATUS_ERRORS 17334
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 17334
HPS_STATUS_2XX 0
HPS_STATUS_NON_2XX 17334
HPS_STATUS_UNEXPECTED 17334
HPS_STATUS_CODES 500=17334